{
  "backend/main.mo": "Main Motoko actor for a food delivery app implementing profile management, menu CRUD, and order lifecycle with role-based access control via MixinAuthorization and AccessControl mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features with file targets, component dependencies, test IDs, and confidence levels — covering order state persistence, polling fixes, and courier dashboard improvements.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering hooks, components, pages, and config files for the FoodRush/Deccan BHOJAN delivery app.",
  "frontend/index.css": "Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including background, foreground, card, border, and chart color tokens.",
  "frontend/index.html": "HTML entry point for 'The Deccan BHOJAN' app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with a customer portal layout route at '/' and a standalone courier app route at '/courier'.",
  "frontend/src/components/AccountView.tsx": "Account management component that displays a login prompt for unauthenticated users or a profile form (name, phone) for authenticated users, backed by useGetCallerProfile and useSaveCallerProfile hooks.",
  "frontend/src/components/CartPanel.tsx": "A slide-in cart panel component that displays cart items with quantity controls, item removal, and a checkout button, showing a total price in INR.",
  "frontend/src/components/CheckoutForm.tsx": "A checkout form component that requires Internet Identity authentication, pre-fills user profile data, and submits an order via the placeOrder mutation.",
  "frontend/src/components/CourierPinGate.tsx": "A PIN entry gate component using a 4-digit OTP input that grants or denies access to the courier dashboard with shake animation on incorrect PIN.",
  "frontend/src/components/CustomerNavigation.tsx": "A sticky top navigation bar for the customer portal with nav links, a cart icon with item count badge, and Internet Identity sign-in/sign-out functionality.",
  "frontend/src/components/CustomerPortalLayout.tsx": "A layout wrapper for the customer portal that renders child routes via Outlet and includes a footer with copyright and a caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "An empty file with no content or exports.",
  "frontend/src/components/LoginButton.tsx": "A reusable button component that handles Internet Identity login and logout, showing appropriate icons and a loading spinner during authentication.",
  "frontend/src/components/MenuManagementSection.tsx": "An admin section for managing menu items with add, edit, toggle availability, and delete operations, using dialogs for forms and per-item loading states.",
  "frontend/src/components/MenuSection.tsx": "Renders a categorized grid of menu items with add-to-cart and quantity increment/decrement controls, reflecting current cart state.",
  "frontend/src/components/MyOrdersView.tsx": "Displays a authenticated user's order history sorted by date, with loading/error states and a manual refresh button.",
  "frontend/src/components/Navigation.tsx": "Empty file with no content.",
  "frontend/src/components/OrderCard.tsx": "Renders an individual order card for the admin/restaurant view with order details, status badge, and buttons to advance or cancel the order status.",
  "frontend/src/components/OrderConfirmation.tsx": "Shows a post-order confirmation screen with a step-by-step status stepper that reflects the live order status fetched by order ID.",
  "frontend/src/components/OrderFilters.tsx": "Renders a horizontal scrollable filter bar for order statuses, showing item counts per status and highlighting the active filter.",
  "frontend/src/components/OrderStatusBadge.tsx": "Displays a styled badge pill for a given order status with an optional animated dot indicator.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects and validates a new user's name and phone number, then saves the profile via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Manages a shopping cart stored in sessionStorage, providing add, remove, update quantity, and clear operations along with computed total and item count.",
  "frontend/src/hooks/useCourierAccess.ts": "Controls courier dashboard access via a hardcoded PIN, persisting the access state in localStorage with grant and revoke functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions and identity state to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including profile, menu, and order CRUD operations, wrapping actor calls with proper cache invalidation.",
  "frontend/src/index.css": "Defines global styles using Tailwind CSS with a white-and-orange design system, custom CSS variables, status badge utilities, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CourierApp.tsx": "Courier dashboard page that displays and manages all orders with filtering and tab navigation, gated behind a PIN entry component.",
  "frontend/src/pages/CustomerPortal.tsx": "Main customer-facing page for 'The Deccan BHOJAN' that renders navigation, hero banner, menu browsing by category, cart panel, checkout form, order confirmation, order history, and account views, with profile setup modal for new authenticated users.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both query strings and hash-based routes, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (orange palette, semantic tokens), fonts (Sora, Inter), border radii, box shadows, and keyframe animations, plus animate/typography/container-queries plugins.",
  "project_state.json": "Project state snapshot (version 23) describing the two-app architecture (Customer Portal + Courier App sharing one Motoko backend), known bugs, existing features, and architectural notes including auth and order-status flow."
}