{
  "backend/main.mo": "Main Motoko actor implementing the food delivery backend with menu management, order placement/tracking, and customer profile APIs, all protected by role-based access control (admin/user permissions).",
  "backend/migration.mo": "Data migration module that converts legacy orders (with text customerId) to the new schema (with Principal customerId), mapping old orders to the anonymous principal and initializing an empty customers map.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their source files, component dependencies, and test IDs for the food delivery platform's customer portal and courier app.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each component's role in the food delivery UI including hooks, pages, and shared components.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark themes, covering background, foreground, card, primary, secondary, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with a single '/' route rendering CustomerPortal inside the CustomerPortalLayout shell.",
  "frontend/src/components/AccountView.tsx": "Account tab view for authenticated users that displays and allows editing of saved name/phone profile data and shows a summary of the three most recent orders, with a sign-in prompt for unauthenticated users.",
  "frontend/src/components/CartPanel.tsx": "Renders a shopping cart panel with item list, quantity controls, remove buttons, and a checkout button. Supports both inline card and sheet display modes.",
  "frontend/src/components/CheckoutForm.tsx": "Checkout form component that collects customer name and phone, pre-fills from profile, and submits an order via the placeOrder mutation. Redirects unauthenticated users to sign in first.",
  "frontend/src/components/CustomerNavigation.tsx": "Sticky top navigation bar for the customer portal with links to Menu, My Orders, and Account views, plus a login button and responsive mobile menu.",
  "frontend/src/components/CustomerPortalLayout.tsx": "Layout wrapper for the customer portal that renders an Outlet for child routes and a footer with branding and a caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "Empty file with no content.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate loading, sign-in, or sign-out states.",
  "frontend/src/components/MenuSection.tsx": "Displays a categorized grid of menu items with emoji headers, item descriptions, prices, and add/quantity controls that sync with the cart.",
  "frontend/src/components/MyOrdersView.tsx": "Shows the authenticated user's order history sorted by timestamp with status badges and item details, or prompts unauthenticated users to sign in.",
  "frontend/src/components/Navigation.tsx": "Empty file with no content.",
  "frontend/src/components/OrderCard.tsx": "Displays a single customer order as a card with status badge, timestamp, total price, expandable item list, and action buttons to advance order status or cancel the order.",
  "frontend/src/components/OrderConfirmation.tsx": "Shows an order confirmation screen with a success header, order ID, a visual progress stepper tracking status from pending to delivered, and a button to place a new order.",
  "frontend/src/components/OrderFilters.tsx": "Renders a horizontal scrollable row of filter buttons for all order statuses, highlighting the active filter and showing per-status order counts.",
  "frontend/src/components/OrderStatusBadge.tsx": "Renders a styled pill badge with a pulsing colored dot representing a given order status (pending, accepted, preparing, out for delivery, delivered, or cancelled).",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and phone number, validates the inputs, and saves the profile via the useSaveCallerProfile mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state (add, remove, update quantity, clear) with sessionStorage persistence, and exposes derived totals and item count.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout flow, and expose the current identity and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating menu items, orders, and customer profiles via the backend actor, including polling intervals and cache invalidation.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind layers, defines CSS custom properties for the design system (colors, status badges, dark mode), and adds utility classes like hero gradients and card hover effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/CourierApp.tsx": "Courier dashboard page that displays all orders with status-based filtering and priority sorting, featuring a sticky header with a manual refresh button and loading/error states.",
  "frontend/src/pages/CustomerPortal.tsx": "Customer-facing portal page managing menu browsing, cart, checkout, order confirmation, and profile setup modal, with authentication-gated flows and automatic menu seeding when empty.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both regular and hash-based routing), persist them to sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Inter, Sora), oklch-based color tokens, border radii, box shadows, and keyframe animations, while enabling dark mode and including typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 5), describing two standalone frontend apps (Customer Portal and Courier App) sharing one Motoko backend, along with existing features, architectural notes, and known issues."
}