{
  "backend/main.mo": "Main Motoko actor for a food delivery app implementing menu management, order placement/tracking, and customer profile APIs with role-based access control for admin and user permissions.",
  "feature_evidence.json": "Feature evidence report documenting the PIN-based access gate feature for the Courier App, listing the affected files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference index for the project's React components, hooks, and pages.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the React app titled 'The Deccan BHOJAN' that mounts the root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with two routes: '/' for the CustomerPortal (with shared layout) and '/courier' for the standalone CourierApp.",
  "frontend/src/components/AccountView.tsx": "Account tab component that shows a sign-in prompt for unauthenticated users or displays a profile edit form and recent order history for authenticated users.",
  "frontend/src/components/CartPanel.tsx": "Shopping cart panel component displaying cart items with quantity increment/decrement and remove controls, a total, and a checkout button; supports both sidebar and sheet display modes.",
  "frontend/src/components/CheckoutForm.tsx": "Renders a checkout form that collects customer name and phone, pre-fills from profile if available, and submits an order via the placeOrder mutation. Shows a login prompt if the user is not authenticated.",
  "frontend/src/components/CourierPinGate.tsx": "Displays a 4-digit PIN entry screen for courier dashboard access, auto-submitting on completion and showing a shake/error animation on incorrect PIN.",
  "frontend/src/components/CustomerNavigation.tsx": "Sticky top navigation bar for the customer portal with links to Menu, My Orders, and Account views, including a responsive mobile menu and login button.",
  "frontend/src/components/CustomerPortalLayout.tsx": "Layout wrapper for the customer portal that renders child routes via Outlet and includes a footer with branding and a caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "Empty file with no content.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate loading, sign-in, or sign-out states.",
  "frontend/src/components/MenuManagementSection.tsx": "Admin section for managing menu items with dialogs to add, edit, delete, and toggle availability of items, backed by React Query mutation hooks.",
  "frontend/src/components/MenuSection.tsx": "Displays a categorized grid of menu items with add-to-cart and quantity increment/decrement controls, using emoji icons per category.",
  "frontend/src/components/MyOrdersView.tsx": "Displays a customer's order history, showing a login prompt if unauthenticated, skeletons while loading, or a sorted list of orders with status badges and item details.",
  "frontend/src/components/Navigation.tsx": "Empty file with no content.",
  "frontend/src/components/OrderCard.tsx": "Renders an admin-facing order card with order details, expandable item list, and action buttons to advance the order through status stages or cancel it.",
  "frontend/src/components/OrderConfirmation.tsx": "Shows a post-order confirmation screen with a progress stepper visualizing the order's current status and a button to place a new order.",
  "frontend/src/components/OrderFilters.tsx": "Renders a horizontal scrollable filter bar for order statuses (all, pending, accepted, etc.) with per-status counts and active highlighting.",
  "frontend/src/components/OrderStatusBadge.tsx": "Displays a styled pill badge with a pulsing dot for a given OrderStatus, supporting small and medium sizes.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and phone number on first login and saves the profile via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with sessionStorage persistence, exposing helpers to add, remove, update quantity, and clear items along with total price and item count.",
  "frontend/src/hooks/useCourierAccess.ts": "React hook that manages PIN-based courier access using localStorage, exposing grantAccess (validates PIN '1953'), revokeAccess, and hasAccess state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context/hook providing Internet Identity authentication via DFINITY's AuthClient, exposing login, clear, identity, and login status state to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating menu items and orders against the backend actor, including queries for menu, orders by ID, and mutations for add/update/delete/toggle.",
  "frontend/src/index.css": "Global stylesheet importing Tailwind and Google Fonts, defining CSS custom properties for light/dark themes, and utility classes for status badges, hero gradient, card hover, and shake animation.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CourierApp.tsx": "Courier-facing page protected by a PIN gate that displays all orders with filtering/sorting and a menu management tab, with refresh and lock-out controls.",
  "frontend/src/pages/CustomerPortal.tsx": "Customer-facing portal rendering the menu, cart sheet, checkout flow, order confirmation, and account views, with automatic menu seeding and profile setup modal for authenticated users.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens using oklch CSS variables, extended typography/border/shadow/animation settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot describing two standalone frontend apps (Customer Portal and Courier App) sharing a single Motoko backend, including architectural notes, existing features, known issues, and versioning metadata."
}