{
  "kind": "build_request",
  "title": "Add PIN-based access gate to the Courier App",
  "projectName": "The Deccan BHOJAN",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add a PIN-based access gate to the Courier App at '/courier'. When a user visits the route, they must first see a PIN entry screen (styled with the app's warm orange/cream theme) instead of the dashboard. If the user enters the PIN '1953' and submits, access is granted and the full Courier App dashboard is shown. If the PIN is incorrect, display a clear error message. The granted access state must be persisted in localStorage so the user does not need to re-enter the PIN on page refresh. A 'Lock' or 'Sign Out' button must be visible in the Courier App UI to clear the access state and return the user to the PIN entry screen. Remove or bypass any existing Internet Identity / role-based access control checks that are currently blocking users in CourierApp.tsx.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "make it so that when the pin 1953 is typed it gives admin access",
          "Visiting `/courier` shows a PIN entry screen; entering '1953' grants access to the full dashboard. Wrong PIN shows an error. Access persists in localStorage. A 'Lock' button lets the courier log out of the Courier App."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to '/courier' without a stored access token shows a PIN entry screen and not the dashboard.",
        "Entering '1953' and submitting grants access and renders the full Courier App dashboard.",
        "Entering any other PIN displays a visible error message and does not grant access.",
        "After granting access, refreshing the page still shows the dashboard (localStorage persistence).",
        "A 'Lock' button is visible in the Courier App. Clicking it clears the stored access and returns to the PIN entry screen.",
        "The PIN entry screen uses the app's warm orange/cream visual theme (consistent with the rest of the app).",
        "No Internet Identity login or role-based check blocks access once the correct PIN is entered."
      ]
    }
  ],
  "constraints": [
    "The PIN '1953' must be the only valid access credential — no Internet Identity or other auth required for the Courier App.",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Access state must be persisted in localStorage, not sessionStorage."
  ],
  "nonGoals": [
    "Adding server-side PIN validation or storing the PIN in the backend.",
    "Changing the Customer Portal authentication flow.",
    "Adding multiple PIN codes or a PIN management system.",
    "Encrypting or hashing the PIN in localStorage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}