{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PIN-based access gate to the Courier App",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add PIN-based access gate to '/courier' that replaces Internet Identity authentication with a simple PIN entry screen (PIN: 1953) and persists access in localStorage",
      "acceptanceCriteria": [
        "Navigating to '/courier' without a stored access token shows a PIN entry screen and not the dashboard.",
        "Entering '1953' and submitting grants access and renders the full Courier App dashboard.",
        "Entering any other PIN displays a visible error message and does not grant access.",
        "After granting access, refreshing the page still shows the dashboard (localStorage persistence).",
        "A 'Lock' button is visible in the Courier App. Clicking it clears the stored access and returns to the PIN entry screen.",
        "The PIN entry screen uses the app's warm orange/cream visual theme (consistent with the rest of the app).",
        "No Internet Identity login or role-based check blocks access once the correct PIN is entered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CourierPinGate.tsx",
          "operation": "create",
          "description": "Create a PIN entry component that displays a centered PIN input form with the app's warm orange/cream theme. The component validates that the entered PIN matches '1953' and stores 'courierAccess' in localStorage upon success. Display an error message for incorrect PINs. Include form elements styled consistently with the existing app design (similar to ProfileSetupModal or CheckoutForm styling patterns)."
        },
        {
          "path": "frontend/src/hooks/useCourierAccess.ts",
          "operation": "create",
          "description": "Create a custom hook that manages courier access state using localStorage. Export functions to check if access is granted (by reading 'courierAccess' from localStorage), grant access (by setting 'courierAccess' to 'true'), and revoke access (by removing 'courierAccess'). Return the current access state and these control functions."
        },
        {
          "path": "frontend/src/pages/CourierApp.tsx",
          "operation": "modify",
          "description": "Wrap the entire CourierApp content with access control logic using the useCourierAccess hook. If access is not granted, render the CourierPinGate component instead of the dashboard. Remove or bypass all Internet Identity checks (useInternetIdentity hook usage, identity null checks, isCallerAdmin checks, and the AccessDeniedScreen component). Add a 'Lock' button to the UI (in the header or navigation area) that calls the revoke access function and returns the user to the PIN entry screen. Ensure the dashboard renders immediately once PIN access is granted."
        }
      ]
    }
  ]
}