{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify Courier App order actions to Delete and Deliver only",
  "requirements": [
    {
      "id": "REQ-56",
      "summary": "Remove all intermediate status action buttons from order cards in the Courier App, keeping only Deliver and Delete buttons. The Deliver button must call updateOrderStatus to set status directly to 'delivered', and the Delete button must show a confirmation prompt then call useDeleteOrder.",
      "acceptanceCriteria": [
        "Each order card in the Courier App shows exactly two action buttons: 'Deliver' and 'Delete'.",
        "Clicking 'Deliver' marks the order as 'delivered' by calling the appropriate backend mutation.",
        "Clicking 'Delete' shows a confirmation prompt; on confirmation, calls useDeleteOrder and the order disappears from the dashboard.",
        "No 'Accept', 'Preparing', 'Out for Delivery', or any other intermediate status buttons are rendered on any order card.",
        "The Deliver button is styled with the app's white and orange (#F97316) theme.",
        "The Delete button is styled consistently with the app's white and orange (#F97316) theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OrderCard.tsx",
          "operation": "modify",
          "description": "Remove all intermediate status advancement buttons (Accept, Preparing, Out for Delivery) from the order card component. Replace the existing status-flow logic with exactly two action buttons: (1) a 'Deliver' button that calls updateOrderStatus with status 'delivered' directly, and (2) a 'Delete' button that shows a confirmation dialog before calling the delete mutation. Style both buttons consistently with the app's white and orange (#F97316) theme. Ensure the Deliver button is prominent and uses the primary orange color, while the Delete button uses a neutral or warning style."
        },
        {
          "path": "frontend/src/pages/CourierApp.tsx",
          "operation": "modify",
          "description": "Review and simplify any status-flow logic in the courier dashboard page. Ensure that order cards rendered here only display the two simplified action buttons (Deliver and Delete) with no intermediate status controls. Remove any conditional rendering logic that shows different buttons based on current order status, keeping only the two required actions available for all non-delivered, non-cancelled orders."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Remove filter tabs for intermediate order statuses (accepted, preparing, out_for_delivery) from the Courier App filter bar. Keep only the simplified workflow statuses: pending, delivered, cancelled, and an All option.",
      "acceptanceCriteria": [
        "The order filter bar in the Courier App does not show 'Accepted', 'Preparing', or 'Out for Delivery' filter tabs.",
        "Filter tabs present are: All, Pending, Delivered, and Cancelled.",
        "Per-status counts in the filter bar reflect only the visible statuses."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OrderFilters.tsx",
          "operation": "modify",
          "description": "Remove the filter tabs for 'accepted', 'preparing', and 'out_for_delivery' order statuses from the filter bar component. Keep only the tabs for 'All', 'pending', 'delivered', and 'cancelled'. Ensure the per-status count badges correctly reflect the counts for only these visible statuses. Update any TypeScript types or constants that define the available filter options to match the simplified workflow."
        }
      ]
    }
  ]
}