{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 5,
  "summary": "Two separate standalone web apps sharing a single backend: (1) a Customer Portal with Internet Identity login, nav bar (Browse Menu, My Orders, Account), menu browsing, cart, checkout pre-filled from profile, order history, and account management; and (2) a Courier App with a full order dashboard and status controls (pending → accepted → preparing → out_for_delivery → delivered). Both apps share one Motoko backend actor handling orders, menu, and customer profiles. No cross-app navigation.",
  "architectural_notes": [
    "Order status flow: placed → preparing → out for delivery → delivered",
    "Two separate standalone frontend deployments (Customer Portal + Courier App) sharing one Motoko backend actor",
    "Customer Portal uses Internet Identity for authentication; orders are tied to logged-in user principal"
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-build-the-customer-portal-as-the-primary-frontend-view-it-must-include-a-menu-browsing-page-showing-available-food-items-grouped-by-category-with-names-descriptions-and-prices-a-shopping-cart-sidebar-or-panel-where-customers-can-add-remove-items-and-see-the-running-total-a-checkout-form-collecting-customer-name-and-phone-number-and-an-order-confirmation-screen-showing-the-assigned-orderid-and-initial-status",
      "title": "Build the Customer Portal as the primary frontend view. It must include: a menu browsing page showing available food items grouped by category with names, descriptions, and prices; a shopping cart sidebar or panel where customers can add/remove items and see the running total; a checkout form collecting customer name and phone number; and an order confirmation screen showing the assigned orderId and initial status.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-build-the-courier-app-as-a-second-distinct-frontend-view-accessible-via-a-separate-route-such-as-courier-it-must-display-all-incoming-orders-in-a-dashboard-allow-a-courier-to-accept-a-pending-order-and-provide-status-update-controls-to-advance-an-order-through-the-lifecycle-pending-accepted-preparing-out-for-delivery-delivered-orders-should-be-grouped-or-filterable-by-status-each-order-card-must-show-orderid-customer-name-ordered-items-total-price-and-current-status",
      "title": "Build the Courier App as a second distinct frontend view (accessible via a separate route such as '/courier'). It must display all incoming orders in a dashboard, allow a courier to accept a pending order, and provide status update controls to advance an order through the lifecycle: pending → accepted → preparing → out_for_delivery → delivered. Orders should be grouped or filterable by status. Each order card must show: orderId, customer name, ordered items, total price, and current status.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-top-level-navigation-bar-that-lets-users-switch-between-the-customer-portal-and-the-courier-app-include-clear-labels-order-food-customer-portal-and-courier-dashboard-apply-a-cohesive-appetizing-visual-theme-across-both-views-warm-tones-deep-orange-cream-charcoal-with-bold-typography-card-based-layouts-and-smooth-status-badge-transitions-enforce-the-theme-consistently-on-all-shared-components-nav-buttons-cards-status-badges",
      "title": "Add a top-level navigation bar that lets users switch between the Customer Portal and the Courier App. Include clear labels: 'Order Food' (customer portal) and 'Courier Dashboard'. Apply a cohesive, appetizing visual theme across both views — warm tones (deep orange, cream, charcoal) with bold typography, card-based layouts, and smooth status badge transitions. Enforce the theme consistently on all shared components (nav, buttons, cards, status badges).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-integrate-internet-identity-authentication-into-the-customer-portal-add-login-logout-controls-to-the-navigation-bar-protected-routes-my-orders-account-should-redirect-unauthenticated-users-to-a-login-prompt-support-passkeys-google-apple-and-microsoft-sign-in-methods-via-internet-identity",
      "title": "Integrate Internet Identity authentication into the Customer Portal. Add login/logout controls to the navigation bar. Protected routes (My Orders, Account) should redirect unauthenticated users to a login prompt. Support passkeys, Google, Apple, and Microsoft sign-in methods via Internet Identity.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-navigation-bar-to-the-customer-portal-with-three-tabs-browse-menu-my-orders-and-account-the-existing-top-level-shared-navigation-linking-to-the-courier-dashboard-must-be-removed-from-the-customer-portal-the-courier-app-must-have-no-link-back-to-the-customer-portal",
      "title": "Add a navigation bar to the Customer Portal with three tabs: 'Browse Menu', 'My Orders', and 'Account'. The existing top-level shared navigation linking to the Courier Dashboard must be removed from the Customer Portal. The Courier App must have no link back to the Customer Portal.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "feature-build-a-my-orders-view-inside-the-customer-portal-when-the-user-is-authenticated-fetch-and-display-their-full-order-history-using-getordersbycustomer-keyed-by-their-principal-each-order-entry-must-show-orderid-order-date-time-list-of-items-with-quantities-total-price-and-current-status-badge-orders-should-be-sorted-newest-first",
      "title": "Build a 'My Orders' view inside the Customer Portal. When the user is authenticated, fetch and display their full order history using getOrdersByCustomer keyed by their principal. Each order entry must show: orderId, order date/time, list of items with quantities, total price, and current status badge. Orders should be sorted newest first.",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "feature-build-an-account-view-inside-the-customer-portal-display-and-allow-editing-of-the-logged-in-user-s-saved-name-and-phone-number-using-getprofile-and-saveprofile-also-show-a-summary-of-the-user-s-recent-orders-the-checkout-form-must-pre-fill-name-and-phone-from-the-saved-profile-when-the-user-is-authenticated",
      "title": "Build an 'Account' view inside the Customer Portal. Display and allow editing of the logged-in user's saved name and phone number using getProfile and saveProfile. Also show a summary of the user's recent orders. The checkout form must pre-fill name and phone from the saved profile when the user is authenticated.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Customer portal for browsing menu and placing food orders",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Courier app for accepting orders and updating order status (preparing, out for delivery, delivered, etc.)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Shared backend database to track and persist orders across both apps",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Create a backend Motoko actor with a persistent orders database. The data model must include: orderId, customerId (or customer name/contact), list of ordered items (item name, quantity, price), total price, order timestamp, and order status (one of: 'pending', 'accepted', 'preparing', 'out_for_delivery', 'delivered', 'cancelled'). Expose CRUD functions: placeOrder, getOrderById, getOrdersByCustomer, getAllOrders, updateOrderStatus, and cancelOrder.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Create a backend function to manage a food menu. The menu should contain items with: itemId, name, description, price, category (e.g., 'Burgers', 'Drinks', 'Sides'), and availability (boolean). Expose functions: getMenu (returns all available items) and getMenuByCategory.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Split into two separate standalone frontend apps (Customer Portal and Courier App) sharing one Motoko backend; remove cross-app navigation bar from both",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Add Internet Identity login (passkeys, Google, Apple, Microsoft) to Customer Portal with account profiles (saved name/contact) and order history",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Add navigation bar to Customer Portal with Browse Menu, My Orders, and Account sections; checkout pre-fills from account profile and ties orders to logged-in user",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "Add a customer profile system to the backend. Associate a profile with each Internet Identity principal. The profile must store: name (text) and phone number (text). Expose functions: getProfile(principal) and saveProfile(principal, name, phone). Orders placed while authenticated must store the caller's principal as customerId.",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-14",
      "summary": "Generate a migration file (backend/migration.mo) to preserve existing in-memory order and menu data when upgrading the backend actor to add the new customer profiles stable map. Ensure existing orders, menu items, and their state are retained after the upgrade.",
      "reqIds": [
        "REQ-11"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Food Order & Delivery Platform",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}